IDEA Open Model
BoltParam.ShearInThread Property
Compatible with IDEA StatiCa 20.1
 Indicates, whether a shear plane is in the thread of a bolt.
 Namespace: IdeaRS.OpenModel.Parameters
 Assembly: IdeaRS.OpenModel (in IdeaRS.OpenModel.dll) Version: 20.1.0
Syntax
public bool ShearInThread { get; set; }
Public Property ShearInThread As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
BoltParam Class
IdeaRS.OpenModel.Parameters Namespace